# CategoryId2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyMemberDifferentCategory..::..CategoryId2 Property
AssemblyMemberDifferentCategory Class See Also
---
Category id of the second assembly member
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId CategoryId2 { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CategoryId2 As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ CategoryId2 {
	ElementId^ get ();
}
```

# See Also
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace